Tekla.Structures.Model.StrandUnbondingData
The StrandUnbondingData class represents the unbonding of a rebar strand.
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
StrandUnbondingData Unbonding = new StrandUnbondingData();
Unbonding.FromEnd = 20;
Unbonding.FromStart = 20;
Unbonding.MiddleToEnd = 30;
Unbonding.MiddleToStart = 30;
Unbonding.StrandIndex = 1;
}
}

Tekla.Structures.Model.StrandUnbondingData.StrandIndex
The index of the strand.

Tekla.Structures.Model.StrandUnbondingData.FromStart
The unbonding from the start of the strand.

Tekla.Structures.Model.StrandUnbondingData.MiddleToStart
The unbonding from the middle of the strand
to the start of the strand.

Tekla.Structures.Model.StrandUnbondingData.MiddleToEnd
The unbonding from the middle of the strand to the end of the strand.

Tekla.Structures.Model.StrandUnbondingData.FromEnd
The unbonding from the end of the strand.

Tekla.Structures.Model.StrandUnbondingData.#ctor
Initializes a new strand unbonding data instance with empty attributes.